#### Pandas-DataFrame And Series
Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A Series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns).

#### Series
##### A Pandas series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table.

In [37]:
import pandas as pd
data = [1,2,3,4,5,6]
series=pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [38]:
## create a Series from dictionary
data = {'a':1,'b':2,'c':3}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [39]:
data=[10,20,30,40]
index = ['a','b','c','d']
pd.Series(data,index=index)

a    10
b    20
c    30
d    40
dtype: int64

In [40]:
## Dataframe
## create a Dataframe from a dictionary of list

data = {
    'Name':['Krish','John','Jack'],
    'Age':[25,30,31],
    'City':['Banglore','Kerla','LosAngles']
}

df=pd.DataFrame(data)
print(df)

    Name  Age       City
0  Krish   25   Banglore
1   John   30      Kerla
2   Jack   31  LosAngles

In [41]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [42]:
import numpy as np
np.array(data)

array({'Name': ['Krish', 'John', 'Jack'], 'Age': [25, 30, 31], 'City': ['Banglore', 'Kerla', 'LosAngles']},
      dtype=object)

In [43]:
## create a Dataframe from a List of Dictionaries
data_list = [
    {'Name':'Jack','Age':25,'City':'Florida'},
    {'Name':'Dainel','Age':30,'City':'Kerla'},
    {'Name':'Danish','Age':40,'City':'Hamirpur'}
    
]
df=pd.DataFrame(data_list)
print(df)

     Name  Age      City
0    Jack   25   Florida
1  Dainel   30     Kerla
2  Danish   40  Hamirpur

In [44]:
df_sales=pd.read_csv('sales_data.csv')
df_sales.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [45]:
df_sales.tail()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [46]:
### Accessing the data from DataFrame
df

     Name  Age      City
0    Jack   25   Florida
1  Dainel   30     Kerla
2  Danish   40  Hamirpur

In [47]:
print(df['Name'])
print(type(df['Name']))

0      Jack
1    Dainel
2    Danish
Name: Name, dtype: object
<class 'pandas.core.series.Series'>

In [48]:
## row
df.loc[1]

Name    Dainel
Age         30
City     Kerla
Name: 1, dtype: object

In [49]:
df.iloc[1][0]

/tmp/ipykernel_163733/1019881219.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[1][0]

'Dainel'

In [50]:
df

     Name  Age      City
0    Jack   25   Florida
1  Dainel   30     Kerla
2  Danish   40  Hamirpur

In [51]:
### Accessing a specified element using .at
print(df.at[1,"Age"])

30

In [52]:
print(df.at[2,"Name"])

Danish

In [53]:
print(df.at[2,"City"])

Hamirpur

In [54]:
## Accessing a specified element using iat 
df.iat[2,0]

'Danish'

In [55]:
df.iat[0,0]

'Jack'

In [56]:
df

     Name  Age      City
0    Jack   25   Florida
1  Dainel   30     Kerla
2  Danish   40  Hamirpur

In [57]:
### Data Manipulation with Dataframe
## Adding column
df['Salary']=[50000,60000,70000]
df

     Name  Age      City  Salary
0    Jack   25   Florida   50000
1  Dainel   30     Kerla   60000
2  Danish   40  Hamirpur   70000

In [58]:
## Remove a column
df.drop('Salary',axis=1,inplace=True)

In [59]:
df

     Name  Age      City
0    Jack   25   Florida
1  Dainel   30     Kerla
2  Danish   40  Hamirpur

In [60]:
## Add age to the column
df['Age']=df['Age']+1

In [61]:
df

     Name  Age      City
0    Jack   26   Florida
1  Dainel   31     Kerla
2  Danish   41  Hamirpur

In [62]:
df.drop(0,inplace=True)

In [63]:
df

     Name  Age      City
1  Dainel   31     Kerla
2  Danish   41  Hamirpur

In [64]:
# Display the data types of each column
print("Data types:\n",df_sales.dtypes)

# Describe the DataFrames
print("Statistical summary:\n",df_sales.describe())

# Group by a column and perform an aggregation
grouped = df_sales.groupby("Category")['Value'].mean()
print("Mean value by category:\n",grouped)

Data types:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object
Statistical summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

KeyError: 'Category'

In [66]:
df_sales.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000